package com.sist.io;
/*	1. 프로그램
 * 		=> 흐름 => 클릭 => 어떤 화면 card.show() => <a href="">
 * 		=> 문법 : 자바 기본
 * 		=> 조립 : 조립 방식 
 * 		------- 소스코딩 숙달
 * 	2. 회화 => 문법(x)
 * 		
 *  3. 소스는 암기
 *  	=> 변수명, 클래스명 => 암기가 안 됨
 *  	=> 순서(알고리즘)
 * 	4. 기존의 방법 탈피 => 사용
 * 	5. 사용위치
 * 		1) Application
 * 			= File 입출력
 * 			ObjectInputStream / ObjectOutputStream
 * 		2) Web Application
 * 			= 데이터베이스
 * 			SQL => 파일 사용 없이
 * 			--- 오라클 => MySQL = MariaDB
 * 
 * 
 * 		=> 객체 생성시 
 * 			new 사용하면 결합성이 높은 프로그램 => 가급적이면 new 사용하지 않는다
 * 					   ----- 에러시 => 다른 클래스 영향이 있는지 확인
 * 			new 없이 객체 생성이 가능
 * 			---------------------
 * 			ㄴ리플렉션 => 스프링
 * 			ㄴ메모리 누수 현상 방지 (new 남발) => 패턴(싱글턴)
 * 
 * 		=> 디자인 패턴
 * 		   ---------
 * 			GOF 패턴 : 23가지 => 8가지
 * 			-----------------------
 * 			싱글턴 : 데이터베이스 => Connection => XE(50)
 * 			클래스 여러개 관리 => 팩토리 패턴 
 * 			자동 형변환 => 어뎁터 패턴
 * 			------------------------------------------
 * 			MV 패턴 
 * 			데이터 관리 + 화면 UI
 * 			------------------
 * 			MVC 패턴 
 * 			
 * 		
 * 			
 * 			
 */
public class 라이브러리_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
