/*
 *	논리연산자 ==> 결과값은 true / false 
 *	&&(앤드) : 직렬연산자 => 범위, 기간 포함
 *			  jumsu>=0 && jumsu<=100 0~100 사이에 있는지
 *
 *	||(오어) : 병렬연산자 => 범위, 기간을 벗어난 경우
 *			  jumsu<0 || jumsu>100 ==> 오류처리 할 때? 하...
 *
 *
 *	false    ===> false  앤드조건은 false 하나만 있어도 false이기 때문에 처음에 false가 나오면 뒤에 조건 수행 안 하고 걍 false 처리함
 *	(조건) && (조건)
 *	 ---	 ---
 *	  |       |
 *	  --------
 *  	  |
 *  	(결과값)
 *  
 *  
 *  true    ===> true  앤드조건은 true 하나만 있어도 true이기 때문에 처음에 true가 나오면 뒤에 조건 수행 안 하고 걍 true 처리함
 *  (조건) || (조건)
 *	 ---	 ---
 *	  |       |
 *	  --------
 *  	  |
 *  	(결과값)
 *  
 *  ---------------------------------------------------------------
 *  						&&				||
 *  ---------------------------------------------------------------
 *	true true  				true			true
 *  ---------------------------------------------------------------
 *  true false				false 			true
 *  ---------------------------------------------------------------
 *  false true				false			true
 *  ---------------------------------------------------------------
 *  false false				false			false
 *  ---------------------------------------------------------------
 *  
 *  ---------------------------------------------------------------
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *  
 *
 */
public class 연산자_논리연산자_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int x=10;
		int y=9;
		
		boolean bCheck= x==y && ++y==x;
		//				  ---- false
		//						||
		//				  ---- true => 효율적인 연산
		
		System.out.println("bCheck="+bCheck);
		System.out.println("x="+x);
		System.out.println("y="+y); //9가 출력되었다는 건 맨 처음 문장의 뒤의 조건 수행 안 한 게 확인 됨


	}

}
